README.org
#+STARTUP: overview
#+TITLE: 4th OSCMW Agenda File
#+CREATOR: Fethi Okyar
#+LANGUAGE: en/tr
#+OPTIONS: num:nil
#+ATTR_HTML: :style margin-left: auto; margin-right: auto;


*Secretariat:* Ali Fethi Okyar, Neşet Fatih Biçkin, Ufuk Tan Baler (ME,MSc'23)

* talks:
** M.Sc. Defense
- Topic: Mechanical identification of soft tissues featuring veins/arteries
- Speaker: Ömer Faruk Büyükkaya
- Date and time: <2023-07-31 Mon 09:00>
- Video Call Link: https://meet.google.com/sxr-uuon-kiu
- Youtube Channel: oscmw
- Twitch Live Link:
** M.Sc. Defense
- Topic: Surface acoustic wave based piezoelectric biomass sensors
- Speaker: Ufuk Tan Baler
- Date: TBA
- Date and time: <2023-08-10 Thu 14:00>
- Video Call Link:
- Youtube Channel: oscmw
- Twitch Live Link:
** Industry Talk
- Topic: Industrial ultrasonic converters: operating principles, design considerations, field use, failure modes, computational physics models
- Speaker: Aydin Karaali
- Date: <2023-08-19 Sat 11:00> (Summer Camp Day-1)
* workshop:
** Aug.18:
<2023-08-18 Fri>
*** 19:00 from where we left (github, vascage, etc.)
- Topics
  1. the github repo (mekanotrix), revoking of our two-factor authentication, alternatives
  2. Picking up the pieces: chemo-mechanical computation of muscular contraction in FEAP (https://projects.ce.berkeley.edu/feap)
** Aug.19:
<2023-08-19 Sat>
*** 11:00 Industry Talk and Panel
- Speaker: Aydin Karaali
- Topic: Industrial ultrasonic converters: operating principles, design considerations, field use, failure modes, computational physics models
- Discussion: Modal vibrations of piezo disc
- Discussant: Aydin K., Emek A., Fethi O.
- Sources:
  1. Brissaud, 2010.
  2. Comsol tutorial
*** 15:00 Panel Discussion
- Keywords: piezo-elastodynamics, elastic waves, vibration of plates, thickness shear mode, modal analysis
- Speaker: Ufuk
- Panel Title: Investigation of thickness shear vibration in piezo disks with emphasis on literate programming
- Panelists: Emek, Fethi, Emilio
*** 21:00 Python FEA workshop
- Sources:
  1. https://github.com/seatemelleri/SEA-Temelleri 
** Aug.20:
<2023-08-20 Sun>
*** 11:00 Invited Talk
- Title: 
- Speaker: Ekrem E. (Cambridge Univ.)
*** 15:00 FEniCS workshop 
- Title: installation from source of the FEniCSx in a Ubuntu container
- Online instructor: Ekrem
- Tutor: Ufuk
*** 19:00 Dinner at Lunapark Restaurant
* promo:
** news release 1:
The 4th Open-Source Computational Mechanics Workshop and Summer Camp begins with the M.Sc. thesis defense of @omer. It has been 6 years since we started working on this project and we are excited to share the final outcome with the public. The event will take place on Monday, July 31, 2023, at 09:00 a.m. and will be live streamed. Please see the attached link for details.
* notes:
** to be covered next:
- Keywords: Soft tubes, arteries, dynamic instability, buckling, collapse, infarction, aenurysm, bifurcation
  (Include source papers)
