README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en/tr" xml:lang="en/tr">
<head>
<!-- 2023-08-16 Wed 21:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>4th OSCMW Agenda File</title>
<meta name="author" content="Fethi Okyar" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">4th OSCMW Agenda File</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4b1ac5a">talks:</a>
<ul>
<li><a href="#org161a7be">M.Sc. Defense</a></li>
<li><a href="#orgaa72b43">M.Sc. Defense</a></li>
<li><a href="#orgab1f922">Industry Talk</a></li>
</ul>
</li>
<li><a href="#orgbcc32f6">workshop:</a>
<ul>
<li><a href="#org91d3b88">Aug.18:</a>
<ul>
<li><a href="#org9e726c2">19:00 from where we left (github, vascage, etc.)</a></li>
</ul>
</li>
<li><a href="#org8797915">Aug.19:</a>
<ul>
<li><a href="#org714d04a">11:00 Industry Talk and Panel</a></li>
<li><a href="#org9f968af">15:00 Panel Discussion</a></li>
<li><a href="#org1f3b90c">21:00 Python FEA workshop</a></li>
</ul>
</li>
<li><a href="#org2a10a6e">Aug.20:</a>
<ul>
<li><a href="#org5032184">11:00 Invited Talk</a></li>
<li><a href="#org03b9ebc">15:00 FEniCS workshop</a></li>
<li><a href="#org9c4f097">19:00 Dinner at Lunapark Restaurant</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org883b71f">promo:</a>
<ul>
<li><a href="#org1d57ffd">news release 1:</a></li>
</ul>
</li>
<li><a href="#orgf27af6d">notes:</a>
<ul>
<li><a href="#orgaaf3fe6">to be covered next:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<b>Secretariat:</b> Ali Fethi Okyar, Neşet Fatih Biçkin, Ufuk Tan Baler (ME,MSc'23)
</p>

<div id="outline-container-org4b1ac5a" class="outline-2">
<h2 id="org4b1ac5a">talks:</h2>
<div class="outline-text-2" id="text-org4b1ac5a">
</div>
<div id="outline-container-org161a7be" class="outline-3">
<h3 id="org161a7be">M.Sc. Defense</h3>
<div class="outline-text-3" id="text-org161a7be">
<ul class="org-ul">
<li>Topic: Mechanical identification of soft tissues featuring veins/arteries</li>
<li>Speaker: Ömer Faruk Büyükkaya</li>
<li>Date and time: <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-07-31 Mon 09:00&gt;</span></span></li>
<li>Video Call Link: <a href="https://meet.google.com/sxr-uuon-kiu">https://meet.google.com/sxr-uuon-kiu</a></li>
<li>Youtube Channel: oscmw</li>
<li>Twitch Live Link:</li>
</ul>
</div>
</div>
<div id="outline-container-orgaa72b43" class="outline-3">
<h3 id="orgaa72b43">M.Sc. Defense</h3>
<div class="outline-text-3" id="text-orgaa72b43">
<ul class="org-ul">
<li>Topic: Surface acoustic wave based piezoelectric biomass sensors</li>
<li>Speaker: Ufuk Tan Baler</li>
<li>Date: TBA</li>
<li>Date and time: <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-08-10 Thu 14:00&gt;</span></span></li>
<li>Video Call Link:</li>
<li>Youtube Channel: oscmw</li>
<li>Twitch Live Link:</li>
</ul>
</div>
</div>
<div id="outline-container-orgab1f922" class="outline-3">
<h3 id="orgab1f922">Industry Talk</h3>
<div class="outline-text-3" id="text-orgab1f922">
<ul class="org-ul">
<li>Topic: Industrial ultrasonic converters: operating principles, design considerations, field use, failure modes, computational physics models</li>
<li>Speaker: Aydin Karaali</li>
<li>Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-08-19 Sat 11:00&gt; </span></span> (Summer Camp Day-1)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbcc32f6" class="outline-2">
<h2 id="orgbcc32f6">workshop:</h2>
<div class="outline-text-2" id="text-orgbcc32f6">
</div>
<div id="outline-container-org91d3b88" class="outline-3">
<h3 id="org91d3b88">Aug.18:</h3>
<div class="outline-text-3" id="text-org91d3b88">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2023-08-18 Fri&gt;</span></span>
</p>
</div>
<div id="outline-container-org9e726c2" class="outline-4">
<h4 id="org9e726c2">19:00 from where we left (github, vascage, etc.)</h4>
<div class="outline-text-4" id="text-org9e726c2">
<ul class="org-ul">
<li>Topics
<ol class="org-ol">
<li>the github repo (mekanotrix), revoking of our two-factor authentication, alternatives</li>
<li>Picking up the pieces: chemo-mechanical computation of muscular contraction in FEAP (<a href="https://projects.ce.berkeley.edu/feap">https://projects.ce.berkeley.edu/feap</a>)</li>
</ol></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8797915" class="outline-3">
<h3 id="org8797915">Aug.19:</h3>
<div class="outline-text-3" id="text-org8797915">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2023-08-19 Sat&gt;</span></span>
</p>
</div>
<div id="outline-container-org714d04a" class="outline-4">
<h4 id="org714d04a">11:00 Industry Talk and Panel</h4>
<div class="outline-text-4" id="text-org714d04a">
<ul class="org-ul">
<li>Speaker: Aydin Karaali</li>
<li>Topic: Industrial ultrasonic converters: operating principles, design considerations, field use, failure modes, computational physics models</li>
<li>Discussion: Modal vibrations of piezo disc</li>
<li>Discussant: Aydin K., Emek A., Fethi O.</li>
<li>Sources:
<ol class="org-ol">
<li>Brissaud, 2010.</li>
<li>Comsol tutorial</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-org9f968af" class="outline-4">
<h4 id="org9f968af">15:00 Panel Discussion</h4>
<div class="outline-text-4" id="text-org9f968af">
<ul class="org-ul">
<li>Keywords: piezo-elastodynamics, elastic waves, vibration of plates, thickness shear mode, modal analysis</li>
<li>Speaker: Ufuk</li>
<li>Panel Title: Investigation of thickness shear vibration in piezo disks with emphasis on literate programming</li>
<li>Panelists: Emek, Fethi, Emilio</li>
</ul>
</div>
</div>
<div id="outline-container-org1f3b90c" class="outline-4">
<h4 id="org1f3b90c">21:00 Python FEA workshop</h4>
<div class="outline-text-4" id="text-org1f3b90c">
<ul class="org-ul">
<li>Sources:
<ol class="org-ol">
<li><a href="https://github.com/seatemelleri/SEA-Temelleri">https://github.com/seatemelleri/SEA-Temelleri</a></li>
</ol></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2a10a6e" class="outline-3">
<h3 id="org2a10a6e">Aug.20:</h3>
<div class="outline-text-3" id="text-org2a10a6e">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2023-08-20 Sun&gt;</span></span>
</p>
</div>
<div id="outline-container-org5032184" class="outline-4">
<h4 id="org5032184">11:00 Invited Talk</h4>
<div class="outline-text-4" id="text-org5032184">
<ul class="org-ul">
<li>Title:</li>
<li>Speaker: Ekrem E. (Cambridge Univ.)</li>
</ul>
</div>
</div>
<div id="outline-container-org03b9ebc" class="outline-4">
<h4 id="org03b9ebc">15:00 FEniCS workshop</h4>
<div class="outline-text-4" id="text-org03b9ebc">
<ul class="org-ul">
<li>Title: installation from source of the FEniCSx in a Ubuntu container</li>
<li>Online instructor: Ekrem</li>
<li>Tutor: Ufuk</li>
</ul>
</div>
</div>
<div id="outline-container-org9c4f097" class="outline-4">
<h4 id="org9c4f097">19:00 Dinner at Lunapark Restaurant</h4>
</div>
</div>
</div>
<div id="outline-container-org883b71f" class="outline-2">
<h2 id="org883b71f">promo:</h2>
<div class="outline-text-2" id="text-org883b71f">
</div>
<div id="outline-container-org1d57ffd" class="outline-3">
<h3 id="org1d57ffd">news release 1:</h3>
<div class="outline-text-3" id="text-org1d57ffd">
<p>
The 4th Open-Source Computational Mechanics Workshop and Summer Camp begins with the M.Sc. thesis defense of @omer. It has been 6 years since we started working on this project and we are excited to share the final outcome with the public. The event will take place on Monday, July 31, 2023, at 09:00 a.m. and will be live streamed. Please see the attached link for details.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf27af6d" class="outline-2">
<h2 id="orgf27af6d">notes:</h2>
<div class="outline-text-2" id="text-orgf27af6d">
</div>
<div id="outline-container-orgaaf3fe6" class="outline-3">
<h3 id="orgaaf3fe6">to be covered next:</h3>
<div class="outline-text-3" id="text-orgaaf3fe6">
<ul class="org-ul">
<li>Keywords: Soft tubes, arteries, dynamic instability, buckling, collapse, infarction, aenurysm, bifurcation
(Include source papers)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fethi Okyar</p>
<p class="date">Created: 2023-08-16 Wed 21:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>